# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Frank\Documents\PSoC Creator\IGVC2013\PSoC uC-slave\SonarArray.cydsn\SonarArray.cyprj
# Date: Fri, 29 Mar 2013 18:51:19 GMT
#set_units -time ns
create_clock -name {ClockBlock/clk_bus} -period 41.666666666666664 -waveform {0 20.8333333333333} [get_pins {ClockBlock/clk_bus}]
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyXTAL} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/xtal}]]
create_generated_clock -name {CyIMO} -source [get_pins {ClockBlock/xtal}] -duty_cycle 50 [list [get_pins {ClockBlock/imo}]]
create_generated_clock -name {CyPLL_OUT} -source [get_pins {ClockBlock/imo}] -duty_cycle 50 [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -duty_cycle 50 [list [get_pins {ClockBlock/clk_bus_glb}]]


# Component constraints for C:\Users\Frank\Documents\PSoC Creator\IGVC2013\PSoC uC-slave\SonarArray.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Frank\Documents\PSoC Creator\IGVC2013\PSoC uC-slave\SonarArray.cydsn\SonarArray.cyprj
# Date: Fri, 29 Mar 2013 18:51:12 GMT
